In [1]:
data_path = "./input/popular-names.txt"

10

In [10]:
import pandas as pd

df = pd.read_csv(data_path, sep="\t", header=None)
print(df.shape[0])
df.head()

2780

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

In [9]:
!wc -l ./input/popular-names.txt

2780 ./input/popular-names.txt

11

In [14]:
df = pd.read_csv(data_path, header=None)
df = df.iloc[:, 0].apply(lambda x: x.replace("\t", " "))
df.head()

0         Mary F 7065 1880
1         Anna F 2604 1880
2         Emma F 2003 1880
3    Elizabeth F 1939 1880
4       Minnie F 1746 1880
Name: 0, dtype: object

12

In [15]:
df = pd.read_csv(data_path, sep="\t", header=None)
df.iloc[:, 0].to_csv("./output/col1.txt", index=False, header=None)
df.iloc[:, 1].to_csv("./output/col2.txt", index=False, header=None)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

13

In [18]:
col1 = pd.read_csv("./output/col1.txt", sep="\t", header=None)
col2 = pd.read_csv("./output/col2.txt", sep="\t", header=None)
cols = pd.concat([col1, col2], axis=1)
cols.to_csv("./output/col12.txt", sep="\t", index=False, header=None)

14

In [23]:
# import argparse

# def read_file():
#     parser = argparse.ArgumentParser()
#     parser.add_argument("-N")
# å
#     args = parser.parse_args()

#     df = pd.read_csv(data_path, sep="\t", header=None)
#     print(df.head(args.N))

# read_file()

In [26]:
def rep_Nrows(N):
    df = pd.read_csv(data_path, sep="\t", header=None)
    print(df.head(N))

rep_Nrows(10)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880

15

In [27]:
def rep_Nrows_tail(N):
    df = pd.read_csv(data_path, sep="\t", header=None)
    print(df.tail(N))

rep_Nrows_tail(10)

             0  1      2     3
2770      Liam  M  19837  2018
2771      Noah  M  18267  2018
2772   William  M  14516  2018
2773     James  M  13525  2018
2774    Oliver  M  13389  2018
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

16

In [28]:
def split_file(N):
    df = pd.read_csv(data_path, sep="\t", header=None)
    
    nrow = len(df) // N
    for i in range(N):
        df.iloc[i*nrow:(i+1)*nrow].to_csv(f"./output/popular-names_{i}.txt", sep="\t", index=False, header=None)
    
    return
    
split_file(N=10)

17

In [30]:
df = pd.read_csv(data_path, sep="\t", header=None)
df.iloc[:, 0].unique()

array(['Mary', 'Anna', 'Emma', 'Elizabeth', 'Minnie', 'Margaret', 'Ida',
       'Alice', 'Bertha', 'Sarah', 'John', 'William', 'James', 'Charles',
       'George', 'Frank', 'Joseph', 'Thomas', 'Henry', 'Robert', 'Annie',
       'Edward', 'Clara', 'Florence', 'Ethel', 'Bessie', 'Harry', 'Helen',
       'Ruth', 'Marie', 'Lillian', 'Mildred', 'Dorothy', 'Frances',
       'Walter', 'Evelyn', 'Virginia', 'Richard', 'Betty', 'Donald',
       'Doris', 'Shirley', 'Barbara', 'Patricia', 'Joan', 'Nancy',
       'Carol', 'David', 'Ronald', 'Judith', 'Linda', 'Sandra', 'Carolyn',
       'Sharon', 'Michael', 'Susan', 'Donna', 'Larry', 'Kathleen',
       'Deborah', 'Gary', 'Karen', 'Debra', 'Pamela', 'Cynthia', 'Mark',
       'Steven', 'Lisa', 'Jeffrey', 'Lori', 'Kimberly', 'Tammy', 'Angela',
       'Michelle', 'Jennifer', 'Melissa', 'Christopher', 'Brian', 'Amy',
       'Laura', 'Tracy', 'Julie', 'Jason', 'Scott', 'Stephanie',
       'Heather', 'Nicole', 'Matthew', 'Rebecca', 'Jessica', 'Amanda',
       'Daniel', 'Kelly', 'Joshua', 'Crystal', 'Ashley', 'Megan',
       'Brittany', 'Andrew', 'Justin', 'Samantha', 'Lauren', 'Emily',
       'Brandon', 'Tyler', 'Taylor', 'Nicholas', 'Jacob', 'Hannah',
       'Austin', 'Alexis', 'Rachel', 'Madison', 'Abigail', 'Olivia',
       'Ethan', 'Anthony', 'Isabella', 'Ava', 'Sophia', 'Chloe',
       'Alexander', 'Mia', 'Jayden', 'Noah', 'Aiden', 'Mason', 'Liam',
       'Charlotte', 'Harper', 'Benjamin', 'Elijah', 'Amelia', 'Logan',
       'Oliver', 'Lucas'], dtype=object)

18

In [32]:
df = pd.read_csv(data_path, sep="\t", header=None)
df.sort_values(df.columns[-1], ascending=False)

           0  1      2     3
2779   Logan  M  12352  2018
2769  Evelyn  F  10376  2018
2760    Emma  F  18688  2018
2761  Olivia  F  17921  2018
2762     Ava  F  14924  2018
...      ... ..    ...   ...
16    Joseph  M   2632  1880
17    Thomas  M   2534  1880
18     Henry  M   2444  1880
19    Robert  M   2415  1880
0       Mary  F   7065  1880

[2780 rows x 4 columns]

19

In [33]:
df = pd.read_csv(data_path, sep="\t", header=None)
df.iloc[:, 0].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Crystal      1
Pamela       1
Julie        1
Lucas        1
Laura        1
Name: 0, Length: 136, dtype: int64